package com.arlina.android_laba15_16_kuzvah.data

data class ScheduleItem(
    val id: String,
    val name: String,
    val day: String,
    val time: String,
    val room: String,
    val professor: String
)

val sampleSchedule = listOf(
    ScheduleItem("1", "Понедельник", "08:30–10:00", "Мат моделирование", "2.20", "Трошина О.В"),
    ScheduleItem("2", "Понедельник", "10:10–11:40", "РПМ", "2.20", "Донскова Д.А"),
    ScheduleItem("3", "Понедельник", "12:10–13:40", "РМП", "3.30", "Леонтьев Д.А"),
    ScheduleItem("4", "Понедельник", "13:50–15:20", "ИСРПО", "1.02", "Леонтьев Д.А"),


    ScheduleItem("5", "Вторник", "08:30–10:00", "Системное программирование", "101", "Токаев Т.И"),
    ScheduleItem("6", "Вторник", "10:10–11:40", "Английский", "105", "Пенькова О.В"),
    ScheduleItem("7", "Вторник", "12:10–13:40", "Мат моделирование", "2.20", "Иванов И.И"),


    ScheduleItem("8", "Среда", "08:30–10:00", "Системное программирование", "101", "Токаев"),
    ScheduleItem("9", "Среда", "10:10–11:40", "Английский", "105", "Пенькова О.В"),
    ScheduleItem("10", "Среда", "12:10–13:40", "Мат моделирование", "2.20", "Трошина О.В"),


    ScheduleItem("11", "Четверг", "08:30–10:00", "РПМ", "2.20", "Донскова Д.А"),
    ScheduleItem("12", "Четверг", "10:10–11:40", "ИСРПО", "1.02", "Леонтьев Д.А"),
    ScheduleItem("13", "Четверг", "12:10–13:40", "Английский", "105", "Пенькова О.В"),
    ScheduleItem("14", "Четверг", "13:50–15:20", "Системное программирование", "101", "Токаев Т.И"),


    ScheduleItem("15", "Пятница", "08:30–10:00", "Мат моделирование", "2.20", "Иванов И.И"),
    ScheduleItem("16", "Пятница", "10:10–11:40", "Мат моделирование", "2.20", "Трошина О.В"),
    ScheduleItem("17", "Пятница", "12:10–13:40", "РПМ", "2.20", "Донскова Д.А")
)